#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
workos_organization.demo-2: Refreshing state... [id=org_01GPY9GBAR1JXZ95QEMV3T1SHM]
workos_organization.demo-1: Refreshing state... [id=org_01GPY9GBAXKSAJ30YGFQ3Z22BK]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # workos_organization.amazon will be created
  + resource "workos_organization" "amazon" {
      + allow_profiles_outside_organization = (known after apply)
      + created_at                          = (known after apply)
      + domains                             = [
          + "amazon.com",
          + "amazon.de",
        ]
      + id                                  = (known after apply)
      + name                                = "Amazon"
      + updated_at                          = (known after apply)
    }

  # workos_organization.demo-1 will be destroyed
  # (because workos_organization.demo-1 is not in configuration)
  - resource "workos_organization" "demo-1" {
      - allow_profiles_outside_organization = false -> null
      - created_at                          = "2023-01-16T21:59:27.835Z" -> null
      - domains                             = [
          - "demo-1.provisioned.org",
          - "provisioned.org",
        ] -> null
      - id                                  = "org_01GPY9GBAXKSAJ30YGFQ3Z22BK" -> null
      - name                                = "Provisioned Org #1" -> null
      - updated_at                          = "2023-01-16T21:59:27.835Z" -> null
    }

  # workos_organization.demo-2 will be destroyed
  # (because workos_organization.demo-2 is not in configuration)
  - resource "workos_organization" "demo-2" {
      - allow_profiles_outside_organization = false -> null
      - created_at                          = "2023-01-16T21:59:27.830Z" -> null
      - domains                             = [
          - "demo-2.provisioned.org",
          - "provisioned.org",
        ] -> null
      - id                                  = "org_01GPY9GBAR1JXZ95QEMV3T1SHM" -> null
      - name                                = "Provisioned Org #2" -> null
      - updated_at                          = "2023-01-16T21:59:27.830Z" -> null
    }

  # workos_organization.google will be created
  + resource "workos_organization" "google" {
      + allow_profiles_outside_organization = (known after apply)
      + created_at                          = (known after apply)
      + domains                             = [
          + "google.com",
          + "google.com.ua",
        ]
      + id                                  = (known after apply)
      + name                                = "Google"
      + updated_at                          = (known after apply)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  - all_orgs = {
      - id            = null
      - organizations = [
          - {
              - allow_profiles_outside_organization = true
              - created_at                          = "2023-01-03T14:45:19.332Z"
              - domains                             = [
                  - "first.co",
                ]
              - id                                  = "org_01GNW1G2B4G9FCZ8SD3E7NXK3N"
              - name                                = "First Organization (unmanaged)"
              - updated_at                          = "2023-01-13T19:31:24.573Z"
            },
        ]
    } -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Vellanci, Action: `pull_request`, Working Directory: ``, Workflow: `pr-flow`*